# =========================
#  Системные константы
# =========================
SITE_KEY = "0x4AAAAAABCVqfQCJfxkyXT8"
PAGE_URL = "https://arkm.com/uk/login?redirectPath=%2Fuk"
RES_URL = "http://2captcha.com/res.php"
CREATE_URL = "http://2captcha.com/in.php"
COOKIE_FILE = "cookies.json"
# =========================
# 🔧 Пользовательские настройки
# =========================
DB_NAME = 'trade.db' 
TABLE_NAME = "accounts"
DEFAULT_LEVERAGE = 10
# =========================
#  Points
# =========================
SPOT_FEE = 0.001  
FUTURES_FEE = 0.0005  
    
SPOT_POINTS_TIERS = [
    {'tier': 1, 'volume': 100000, 'points': 200},
    {'tier': 2, 'volume': 250000, 'points': 500},
    {'tier': 3, 'volume': 500000, 'points': 1000},
    {'tier': 4, 'volume': 1000000, 'points': 2000},
    {'tier': 5, 'volume': 2500000, 'points': 5000},
    {'tier': 6, 'volume': 5000000, 'points': 10000},
    {'tier': 7, 'volume': 10000000, 'points': 20000},
    {'tier': 8, 'volume': float('inf'), 'points_per_100k': 300}
]

# Таблица очков для фьючерсов
FUTURES_POINTS_TIERS = [
    {'tier': 1, 'volume': 200000, 'points': 200},
    {'tier': 2, 'volume': 500000, 'points': 500},
    {'tier': 3, 'volume': 1000000, 'points': 1000},
    {'tier': 4, 'volume': 2000000, 'points': 2000},
    {'tier': 5, 'volume': 5000000, 'points': 5000},
    {'tier': 6, 'volume': 10000000, 'points': 10000},
    {'tier': 7, 'volume': 20000000, 'points': 20000},
    {'tier': 8, 'volume': float('inf'), 'points_per_200k': 300}
]

banner = """
 █████╗ ██████╗ ██╗  ██╗██╗  ██╗ █████╗ ███╗   ███╗    ████████╗██████╗  █████╗ ██████╗ ██╗███╗   ██╗ ██████╗     
██╔══██╗██╔══██╗██║ ██╔╝██║  ██║██╔══██╗████╗ ████║    ╚══██╔══╝██╔══██╗██╔══██╗██╔══██╗██║████╗  ██║██╔════╝     
███████║██████╔╝█████╔╝ ███████║███████║██╔████╔██║       ██║   ██████╔╝███████║██║  ██║██║██╔██╗ ██║██║  ███╗    
██╔══██║██╔══██╗██╔═██╗ ██╔══██║██╔══██║██║╚██╔╝██║       ██║   ██╔══██╗██╔══██║██║  ██║██║██║╚██╗██║██║   ██║    
██║  ██║██║  ██║██║  ██╗██║  ██║██║  ██║██║ ╚═╝ ██║       ██║   ██║  ██║██║  ██║██████╔╝██║██║ ╚████║╚██████╔╝    
╚═╝  ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝╚═╝     ╚═╝       ╚═╝   ╚═╝  ╚═╝╚═╝  ╚═╝╚═════╝ ╚═╝╚═╝  ╚═══╝ ╚═════╝     
                                                                                                                  
───────────────────────────────▶  Author: @xflorzoye  ◀───────────────────────────────

"""